anthropic.claude-code
dbaeumer.vscode-eslint
esbenp.prettier-vscode
github.vscode-github-actions
marp-team.marp-vscode
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
